protogia/avr-descriptionfiles-4-nim/svd/AT90PWM3.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTD</name>
      <description>I/O Port</description>
      <baseAddress>0x00000029</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRD</name>
          <description>Port D Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PIND</name>
          <description>Port D Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PORTD</name>
          <description>Port D Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTE</name>
      <description>I/O Port</description>
      <baseAddress>0x0000002C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRE</name>
          <description>Port E Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PINE</name>
          <description>Port E Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PORTE</name>
          <description>Port E Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PSC0</name>
      <description>Power Stage Controller</description>
      <baseAddress>0x000000A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x32</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR0RA</name>
          <description>Output Compare 0 RA Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0RA</name>
              <description>Output Compare RA</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0RB</name>
          <description>Output Compare 0 RB Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0RB</name>
              <description>Output Compare RB</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0SA</name>
          <description>Output Compare 0 SA Register</description>
          <addressOffset>0x32</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0SA</name>
              <description>Output Compare SA</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0SB</name>
          <description>Output Compare 0 SB Register</description>
          <addressOffset>0x36</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0SB</name>
              <description>Output Compare SB</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF0</name>
          <description>PSC 0 Configuration Register</description>
          <addressOffset>0x3A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCLKSEL0</name>
              <description>PSC 0 Input Clock Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POP0</name>
              <description>PSC 0 Output Polarity</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMODE0</name>
              <description>PSC 0 Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_RAMP_MODE</name>
                  <description>One Ramp Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_RAMP_MODE</name>
                  <description>Two Ramp Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_RAMP_MODE</name>
                  <description>Four Ramp Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CENTER_ALIGNED_MODE</name>
                  <description>Center Aligned Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLOCK0</name>
              <description>PSC 0 Lock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PALOCK0</name>
              <description>PSC 0 Autolock</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFIFTY0</name>
              <description>PSC 0 Fifty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTL0</name>
          <description>PSC 0 Control Register</description>
          <addressOffset>0x3B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRUN0</name>
              <description>PSC 0 Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCCYC0</name>
              <description>PSC0 Complete Cycle</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARUN0</name>
              <description>PSC0 Auto Run</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC0A</name>
              <description>PSC 0 Asynchronous Output Control A</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC0B</name>
              <description>PSC 0 Asynchronous Output Control B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBFM0</name>
              <description>PSC 0 Balance Flank Width Modulation</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPRE0</name>
              <description>PSC 0 Prescaler Selects</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIVIDER_ON_PSC_INPUT_CLOCK</name>
                  <description>No divider on PSC input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_4</name>
                  <description>Divide the PSC input clock by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_16</name>
                  <description>Divide the PSC input clock by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_64</name>
                  <description>Divide the PSC input clock by 64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC0A</name>
          <description>PSC 0 Input A Control</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM0A</name>
              <description>PSC 0 Retrigger and Fault Mode for Part A</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE0A</name>
              <description>PSC 0 Filter Enable on Input Part A</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV0A</name>
              <description>PSC 0 Edge Level Selector on Input Part A</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL0A</name>
              <description>PSC 0 Input Select for Part A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE0A</name>
              <description>PSC 0 Capture Enable Input Part A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC0B</name>
          <description>PSC 0 Input B Control</description>
          <addressOffset>0x3D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM0B</name>
              <description>PSC 0 Retrigger and Fault Mode for Part B</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE0B</name>
              <description>PSC 0 Filter Enable on Input Part B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV0B</name>
              <description>PSC 0 Edge Level Selector on Input Part B</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL0B</name>
              <description>PSC 0 Input Select for Part B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE0B</name>
              <description>PSC 0 Capture Enable Input Part B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PICR0</name>
          <description>PSC 0 Input Capture Register </description>
          <addressOffset>0x3E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PICR0</name>
              <description>PSC 0 Input Capture Bytes</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
