protogia/avr-descriptionfiles-4-nim/svd/AT90PWM3.atdf.svd
        <register>
          <name>PIFR0</name>
          <description>PSC0 Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEOP0</name>
              <description>End of PSC0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRN0</name>
              <description>Ramp Number</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEV0A</name>
              <description>External Event A Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEV0B</name>
              <description>External Event B Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEI0</name>
              <description>PSC 0 Synchro Error Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIM0</name>
          <description>PSC0 Interrupt Mask Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEOPE0</name>
              <description>End of Cycle Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEVE0A</name>
              <description>External Event A Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEVE0B</name>
              <description>External Event B Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEIE0</name>
              <description>PSC 0 Synchro Error Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSOC0</name>
          <description>PSC0 Synchro and Output Configuration</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POEN0A</name>
              <description>PSCOUT00 Output Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POEN0B</name>
              <description>PSCOUT01 Output Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSYNC0</name>
              <description>Synchronization Out for ADC Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN0</name>
                  <description>Send signal on leading edge of PSCOUTn0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN0</name>
                  <description>Send signal on trailing edge of PSCOUTn0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN1</name>
                  <description>Send signal on leading edge of PSCOUTn1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN1</name>
                  <description>Send signal on trailing edge of PSCOUTn1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PSC1</name>
      <description>Power Stage Controller</description>
      <baseAddress>0x000000A2</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR1RA</name>
          <description>Output Compare RA Register </description>
          <addressOffset>0x42</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1RB</name>
          <description>Output Compare RB Register </description>
          <addressOffset>0x46</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1SA</name>
          <description>Output Compare SA Register </description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1SB</name>
          <description>Output Compare SB Register </description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PCNF1</name>
          <description>PSC 1 Configuration Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCLKSEL1</name>
              <description>PSC 1 Input Clock Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POP1</name>
              <description>PSC 1 Output Polarity</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMODE1</name>
              <description>PSC 1 Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_RAMP_MODE</name>
                  <description>One Ramp Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_RAMP_MODE</name>
                  <description>Two Ramp Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_RAMP_MODE</name>
                  <description>Four Ramp Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CENTER_ALIGNED_MODE</name>
                  <description>Center Aligned Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLOCK1</name>
              <description>PSC 1 Lock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PALOCK1</name>
              <description>PSC 1 Autolock</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFIFTY1</name>
              <description>PSC 1 Fifty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTL1</name>
          <description>PSC 1 Control Register</description>
          <addressOffset>0x49</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRUN1</name>
              <description>PSC 1 Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCCYC1</name>
              <description>PSC1 Complete Cycle</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARUN1</name>
              <description>PSC1 Auto Run</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC1A</name>
              <description>PSC 1 Asynchronous Output Control A</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC1B</name>
              <description>PSC 1 Asynchronous Output Control B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBFM1</name>
              <description>Balance Flank Width Modulation</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPRE1</name>
              <description>PSC 1 Prescaler Selects</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIVIDER_ON_PSC_INPUT_CLOCK</name>
                  <description>No divider on PSC input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_4</name>
                  <description>Divide the PSC input clock by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_16</name>
                  <description>Divide the PSC input clock by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_64</name>
                  <description>Divide the PSC input clock by 64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC1A</name>
          <description>PSC 1 Input B Control</description>
          <addressOffset>0x4A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM1A</name>
              <description>PSC 1 Retrigger and Fault Mode for Part A</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE1A</name>
              <description>PSC 1 Filter Enable on Input Part A</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV1A</name>
              <description>PSC 1 Edge Level Selector on Input Part A</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL1A</name>
              <description>PSC 1 Input Select for Part A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE1A</name>
              <description>PSC 1 Capture Enable Input Part A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC1B</name>
          <description>PSC 1 Input B Control</description>
          <addressOffset>0x4B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM1B</name>
              <description>PSC 1 Retrigger and Fault Mode for Part B</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE1B</name>
              <description>PSC 1 Filter Enable on Input Part B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV1B</name>
              <description>PSC 1 Edge Level Selector on Input Part B</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL1B</name>
              <description>PSC 1 Input Select for Part B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE1B</name>
              <description>PSC 1 Capture Enable Input Part B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PICR1</name>
          <description>PSC 1 Input Capture Register </description>
          <addressOffset>0x4C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
